13/data/attachments/b4df42c59ba28082.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b5d7f9db-59ba-4d4d-950e-6cab5b1206f6</nif:username>
            <nif:friendToBeAdded>Leonard_second_Friend_43256_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>